//
//                                      _ooOoo_
//                                    o8888888o
//                                       88" . "88
//                                        (| -_- |)
//                                       O\ = /O
//							       ____/`---'\____
//								       .  ' \\| |// `.
//							          / \\||| : |||// \
//						           / _||||| -:- |||||- \
//						              | | \\\ - /// | |
//						           | \_| ''\---/'' | |
//                                \ .-\__ `-` ___/-. /
//                            ___`. .' /--.--\ `. . __
//                      ."" '< `.___\_<|>_/___.' >'"".
//                          | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                          \ \ `-. \_ __\ /__ _/ .-` / /
//     ======`-.____`-.___\_____/___.-`____.-'======
//                                       `=---='
//
//	...................................................................................................
//                  佛祖镇楼                  BUG辟易
//          佛曰:受身无间者永远不死，寿长乃无间地狱中之大劫。
//                  


#include "Header.h"
#include "DEF.h"

int main(void)
{
	struct Settings settings = { "Vicky" , 1 , 0 , 180 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 1 , 1 , 1 , 0 , { 0 , 0 , 0 , 0 } };

	IniBkground(settings);				// Display the initial background       展示初始背景

	MatchUser(settings);				// Match the user with the record      匹配已有存档玩家

	Menu(settings);						// Menu interface                              主菜单界面

	return 0;									// Exit                                                结束程序
}	